from pony import orm

from db.base import Author, Book

data = [
  {
    "first_name": "Հակոբ",
    "last_name": "Պարոնյան",
    "books_name": "Մեծապատիվ մուրացկաններ",
    "description": "«Մեծապատիվ մուրացկաններ», Հակոբ Պարոնյանի վեպը, որը գրվել է 1887 թվականին։ Այն հայ գեղարվեստական արձակի դասական երկերից է։ Դեպքերի հանգուցակետում Աբիսողոմ աղան է՝ ամուսնանալու նպատակով Տրապիզոնից Կոստանդնուպոլիս եկած մի մեծահարուստ, որը զուրկ է հոգեկան ու մտավոր հետաքրքրություններից, անտարբեր՝ ազգի և մարդկության ճակատագրի հանդեպ. նրան հետաքրքրում են միայն իր կենսաբանական պետքերը։ Եվ այս սահմանափակ անձնավորությանը սպասարկելու են գալիս «մեծապատիվ մուրացկանները»՝ կյանքի սոցիալ-հասարակական պայմանների բերումով իրենց անհատականությունը կորցրած ու հոգեպես սնանկ, գումար վաստակելու համար ամեն ինչի ընդունակ հայ «մտավորականության» ներկայացուցիչները՝ թերթի խմբագիրը, քահանան, բանաստեղծը, լուսանկարիչը, բժիշկը, ուսուցիչը, փաստաբանը, դերասանը։"
  },
  {
    "first_name": "Խաչատուր",
    "last_name": "Աբովյան",
    "books_name": "Վերք Հայաստանի",
    "description": "«Վերք Հայաստանի» («Ողբ հայրենասիրի»), հայ նշանավոր գրող Խաչատուր Աբովյանի կողմից 1841 թվականին գրված պատմական վեպ, հայոց ազգային ավետարաններից, դասվում է այնպիսի հուշարձանների շարքը, ինչպիսիք են Մովսես Խորենացու «Հայոց Պատմությունը» և Նարեկացու «Մատյան ողբերգության»-ը։"
  },
  {
    "first_name": "Լև",
    "last_name": "Տոլստոյ",
    "books_name": "Պատերազմ և խաղաղություն",
    "description": "«Պատերազմ և խաղաղություն» վեպում հինգ տոհմերի պատմության միջոցով պատկերված է ֆրանսիացիների ներխուժումը Ռուսաստան և Նապոլեոնյան դարաշրջանի ազդեցությունը ցարական հասարակության վրա։ Վեպի մի հատվածը 1805 թվական[4] վերնագրով տպագրվել է «Русский вестник» ամսագրում 1865 թվականին։ Վեպն ամբողջությամբ առաջին անգամ տպագրվել է 1869 թվականին[5]։ 2009 թվականին Newsweek պարբերականի կազմած լավագույն հարյուր գրքերի ցանկում «Պատերազմ և խաղաղություն» վեպն զբաղեցնում էր առաջին հորիզոնականը[6]։ 2007 թվականին Time ամսագրի կողմից կազմված բոլոր ժամանակների տասը լավագույն գրքերի ցանկում «Պատերազմ և խաղաղություն» վեպը եղել է երրորդը, իսկ «Աննա Կարենինա» վեպը՝ առաջինը[7]։"
  },
  {
    "first_name": "Ալեքսանդր",
    "last_name": "Շիրվանզադեի",
    "books_name": "Քաոս",
    "description": "«Քաոս» վեպը գրվել է 1896-97 թվականներին, սակայն վեպի թեման և սյուժեն գրողին սկսել է մտահոգել 80-ական թվականներից։ Ներքուստ լարված աշխատանքը տևում է շուրջ տասնհինգ տարի, ինչի համար հիմք է հանդիսանում 1881-82 թվականներին Բաքվում մի նշանավոր գերդաստանում ծագած խռովությունը։"
  }
]


@orm.db_session
def populate_data():
    for item in data:
        Book(
            title=item.get("books_name"),
            description=item.get("description"),
            count=1,
            author=Author(
                first_name=item.get("first_name"),
                last_name=item.get("last_name"),
            )
        )


if __name__ == '__main__':
    populate_data()
